---
kind: method
id: M:Autodesk.Revit.DB.ConnectorManager.Dispose
source: html/63d9af7e-70e9-613c-8423-4d6173061897.htm
---
# Autodesk.Revit.DB.ConnectorManager.Dispose Method

Releases all resources used by the ConnectorManager

## Syntax (C#)
```csharp
public void Dispose()
```